@extends('admin.layout')


@section('css')
    <style>
        /* Override the direction for the carousel */
        #carousel {
            direction: rtl !important;
        }

        .count {
            padding: 20px;
            border-radius: 8px;
            box-shadow: rgb(228, 231, 236) 0px 0px 1px 1px, rgba(29, 41, 57, 0.05) 0px 4px 4px;
            background-color: rgb(255, 255, 255);
            display: flex;
            justify-content: space-between;

        }

        .title {
            margin-bottom: 4px;
            border-bottom: 1px dotted rgb(208, 213, 221);
            color: rgb(102, 112, 133);
            width: fit-content;
            padding-bottom: 5px;
            font-weight: 500
        }

        .icone {
            background-color: rgb(239, 248, 255);
            border-radius: 50%;
            display: flex;
            align-items: center;
            justify-content: center;
            width: 44px;
            height: 44px;
        }

        .icone svg {
            width: 24px;
            height: 24px;
        }

        .count .number {
            font-size: 20px;
            line-height: 28px;
            letter-spacing: 0px;
            font-weight: 700;
        }

        .d {
            display: flex;

        }

        .d {
            display: flex;
            flex-wrap: wrap;
            gap: 15px;
        }

        .item {
            width: calc(20% - 15px) !important;
        }

        @media (max-width:993px) {

            .d {
                justify-content: center;
            }

            .item {
                width: calc(50% - 15px) !important;
            }
        }

        @media (max-width:767px) {

            .d {
                justify-content: center;
            }

            .item {
                width: calc(100% - 15px) !important;
            }
        }
    </style>
@endsection

@section('content')
    <div class="d my-4">

        <x-count notClick= true title="اجمالي الطلبات" count="{{ $all }} طلب " color="rgb(249, 250, 251)">
            <svg width="1em" height="1em" viewBox="0 0 20 20" fill="currentColor" xmlns="http://www.w3.org/2000/svg"
                aria-hidden="true" focusable="false" class="">
                <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M9.71333 2.05846C9.8991 1.98048 10.1084 1.98051 10.2942 2.05857L17.5405 5.10357C17.8189 5.22054 18 5.49305 18 5.795C18 5.81319 17.9993 5.83126 17.998 5.84921C17.9993 5.86722 18 5.8854 18 5.90374V14.1977C18 14.4995 17.8192 14.7718 17.5411 14.8889L10.2948 17.9412C10.1087 18.0196 9.89885 18.0196 9.71274 17.9413L2.45911 14.889C2.18092 14.772 2 14.4996 2 14.1977V5.90374C2 5.8854 2.00066 5.86722 2.00195 5.84921C2.00066 5.83126 2 5.81319 2 5.795C2 5.49295 2.18119 5.22038 2.4597 5.10346L9.71333 2.05846ZM3.5 6.92325V13.6996L9.24637 16.1177V9.33552L3.5 6.92325ZM10.7464 9.34143V16.1233L16.5 13.6998V6.92369L10.7464 9.34143ZM15.314 5.795L10.0035 3.56346L8.28923 4.28309L13.6011 6.51477L15.314 5.795ZM11.665 7.32835L7.35195 5.51631L6.33398 5.10388L4.68764 5.795L10.0035 8.02654L11.665 7.32835ZM15.6419 9.27992C15.8026 9.66172 15.6233 10.1014 15.2415 10.2621L12.6737 11.3423C12.2919 11.5029 11.8521 11.3236 11.6915 10.9418C11.5309 10.56 11.7102 10.1203 12.092 9.95968L14.6598 8.87943C15.0416 8.71881 15.4813 8.89811 15.6419 9.27992ZM14.633 12.5061C14.7945 12.8875 14.6162 13.3276 14.2348 13.4891L13.1902 13.9314C12.8088 14.0929 12.3687 13.9146 12.2072 13.5332C12.0457 13.1517 12.224 12.7116 12.6054 12.5501L13.6499 12.1078C14.0314 11.9464 14.4715 12.1246 14.633 12.5061Z"
                    fill="#667085"></path>
            </svg>
        </x-count>

        <x-count title="قيد المراجعة" count="{{ $pending }} طلب " color="rgb(249, 250, 251)">
            <svg width="1em" height="1em" viewBox="0 0 20 20" fill="currentColor" xmlns="http://www.w3.org/2000/svg"
                aria-hidden="true" focusable="false" class="">
                <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M9.71333 2.05846C9.8991 1.98048 10.1084 1.98051 10.2942 2.05857L17.5405 5.10357C17.8189 5.22054 18 5.49305 18 5.795C18 5.81319 17.9993 5.83126 17.998 5.84921C17.9993 5.86722 18 5.8854 18 5.90374V14.1977C18 14.4995 17.8192 14.7718 17.5411 14.8889L10.2948 17.9412C10.1087 18.0196 9.89885 18.0196 9.71274 17.9413L2.45911 14.889C2.18092 14.772 2 14.4996 2 14.1977V5.90374C2 5.8854 2.00066 5.86722 2.00195 5.84921C2.00066 5.83126 2 5.81319 2 5.795C2 5.49295 2.18119 5.22038 2.4597 5.10346L9.71333 2.05846ZM3.5 6.92325V13.6996L9.24637 16.1177V9.33552L3.5 6.92325ZM10.7464 9.34143V16.1233L16.5 13.6998V6.92369L10.7464 9.34143ZM15.314 5.795L10.0035 3.56346L8.28923 4.28309L13.6011 6.51477L15.314 5.795ZM11.665 7.32835L7.35195 5.51631L6.33398 5.10388L4.68764 5.795L10.0035 8.02654L11.665 7.32835ZM15.6419 9.27992C15.8026 9.66172 15.6233 10.1014 15.2415 10.2621L12.6737 11.3423C12.2919 11.5029 11.8521 11.3236 11.6915 10.9418C11.5309 10.56 11.7102 10.1203 12.092 9.95968L14.6598 8.87943C15.0416 8.71881 15.4813 8.89811 15.6419 9.27992ZM14.633 12.5061C14.7945 12.8875 14.6162 13.3276 14.2348 13.4891L13.1902 13.9314C12.8088 14.0929 12.3687 13.9146 12.2072 13.5332C12.0457 13.1517 12.224 12.7116 12.6054 12.5501L13.6499 12.1078C14.0314 11.9464 14.4715 12.1246 14.633 12.5061Z"
                    fill="#667085"></path>
            </svg>
        </x-count>


        <x-count title="محاولة تانية" count="{{ $retryCount }} طلب " color="rgb(255, 246, 237)">
            <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="1.5"
                stroke="rgb(236, 74, 10)" class="w-6 h-6">
                <path stroke-linecap="round" stroke-linejoin="round"
                    d="M15.75 3.75L18 6m0 0l2.25 2.25M18 6l2.25-2.25M18 6l-2.25 2.25m1.5 13.5c-8.284 0-15-6.716-15-15V4.5A2.25 2.25 0 014.5 2.25h1.372c.516 0 .966.351 1.091.852l1.106 4.423c.11.44-.054.902-.417 1.173l-1.293.97a1.062 1.062 0 00-.38 1.21 12.035 12.035 0 007.143 7.143c.441.162.928-.004 1.21-.38l.97-1.293a1.125 1.125 0 011.173-.417l4.423 1.106c.5.125.852.575.852 1.091V19.5a2.25 2.25 0 01-2.25 2.25h-2.25z" />
            </svg>

        </x-count>

        <x-count title="تم المراجعة" count="{{ $reviewedCount }} طلب " color="#ecfdf3">
            <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="1.5" stroke="#039855"
                class="w-6 h-6">
                <path stroke-linecap="round" stroke-linejoin="round"
                    d="M9 12.75L11.25 15 15 9.75M21 12a9 9 0 11-18 0 9 9 0 0118 0z" />
            </svg>

        </x-count>

        <x-count title="تم الالغاء" count="{{ $canceled }} طلب " color="rgb(255, 246, 237)">
            <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="1.5"
                stroke="rgb(236, 74, 10)" class="w-6 h-6">
                <path stroke-linecap="round" stroke-linejoin="round" d="M6 18L18 6M6 6l12 12" />
            </svg>
        </x-count>


        <x-count title="جاري التجهيز للشحن" count="{{ $Shipping }} طلب " color="rgb(249, 250, 251)">
            <svg width="1em" height="1em" viewBox="0 0 20 20" fill="currentColor" xmlns="http://www.w3.org/2000/svg"
                aria-hidden="true" focusable="false" class="">
                <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M2.07922 2.41457C2.26446 2.04409 2.71497 1.89392 3.08545 2.07916L4.61224 2.84255C4.78435 2.92861 4.91681 3.07753 4.9822 3.25851L8.12732 11.9632C8.41566 11.9394 8.70267 11.9578 8.97977 12.015L7.37996 7.05149C7.25591 6.66663 7.45929 6.25271 7.83975 6.11574L10.9115 5.00993C10.9149 5.00868 10.9183 5.00745 10.9217 5.00625L14.2014 3.82557C14.3888 3.75808 14.5954 3.76796 14.7756 3.85302C14.9558 3.93809 15.0947 4.09135 15.1617 4.27898L17.7063 11.404C17.8439 11.7891 17.6476 12.2134 17.265 12.3579L14.9011 13.2505C14.8642 13.2722 14.8248 13.2911 14.7833 13.3066L11.3173 14.6054C11.3189 14.6232 11.3203 14.641 11.3215 14.6587C11.4084 15.9324 10.6278 17.1423 9.36067 17.583C7.84065 18.1115 6.1488 17.3453 5.59469 15.8307C5.12639 14.5506 5.63146 13.178 6.71063 12.4564L3.67332 4.05014L2.41463 3.4208C2.04415 3.23556 1.89398 2.78505 2.07922 2.41457ZM10.9215 13.1498L16.046 11.2148L14.002 5.49158L12.1684 6.15166L12.6404 7.27125C12.8013 7.65293 12.6224 8.09279 12.2407 8.2537C11.859 8.41461 11.4191 8.23563 11.2582 7.85395L10.7551 6.66046L9.03007 7.28147L10.9215 13.1498ZM9.74506 14.3874C9.48162 13.6674 8.65255 13.2681 7.88035 13.5366C7.11644 13.8023 6.74339 14.6047 7.00337 15.3153C7.26682 16.0354 8.09586 16.4347 8.86801 16.1662C9.49988 15.9464 9.86559 15.3561 9.82496 14.7609C9.81682 14.6416 9.79238 14.5205 9.74956 14.3999L9.74506 14.3874Z"
                    fill="#667085"></path>
            </svg>
        </x-count>



        <x-count title="جاهز للتغليف" count="{{ $testing }} طلب " color="rgb(249, 250, 251)">
            <svg width="1em" height="1em" viewBox="0 0 20 20" fill="currentColor" xmlns="http://www.w3.org/2000/svg"
                aria-hidden="true" focusable="false" class="">
                <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M2.07922 2.41457C2.26446 2.04409 2.71497 1.89392 3.08545 2.07916L4.61224 2.84255C4.78435 2.92861 4.91681 3.07753 4.9822 3.25851L8.12732 11.9632C8.41566 11.9394 8.70267 11.9578 8.97977 12.015L7.37996 7.05149C7.25591 6.66663 7.45929 6.25271 7.83975 6.11574L10.9115 5.00993C10.9149 5.00868 10.9183 5.00745 10.9217 5.00625L14.2014 3.82557C14.3888 3.75808 14.5954 3.76796 14.7756 3.85302C14.9558 3.93809 15.0947 4.09135 15.1617 4.27898L17.7063 11.404C17.8439 11.7891 17.6476 12.2134 17.265 12.3579L14.9011 13.2505C14.8642 13.2722 14.8248 13.2911 14.7833 13.3066L11.3173 14.6054C11.3189 14.6232 11.3203 14.641 11.3215 14.6587C11.4084 15.9324 10.6278 17.1423 9.36067 17.583C7.84065 18.1115 6.1488 17.3453 5.59469 15.8307C5.12639 14.5506 5.63146 13.178 6.71063 12.4564L3.67332 4.05014L2.41463 3.4208C2.04415 3.23556 1.89398 2.78505 2.07922 2.41457ZM10.9215 13.1498L16.046 11.2148L14.002 5.49158L12.1684 6.15166L12.6404 7.27125C12.8013 7.65293 12.6224 8.09279 12.2407 8.2537C11.859 8.41461 11.4191 8.23563 11.2582 7.85395L10.7551 6.66046L9.03007 7.28147L10.9215 13.1498ZM9.74506 14.3874C9.48162 13.6674 8.65255 13.2681 7.88035 13.5366C7.11644 13.8023 6.74339 14.6047 7.00337 15.3153C7.26682 16.0354 8.09586 16.4347 8.86801 16.1662C9.49988 15.9464 9.86559 15.3561 9.82496 14.7609C9.81682 14.6416 9.79238 14.5205 9.74956 14.3999L9.74506 14.3874Z"
                    fill="#667085"></path>
            </svg>
        </x-count>

        <x-count title="تم ارسال الشحن" count="{{ $shippedCount }} طلب " color="rgb(249, 250, 251)">
            <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="1.5"
                stroke="currentColor" class="w-6 h-6">
                <path stroke-linecap="round" stroke-linejoin="round"
                    d="M8.25 18.75a1.5 1.5 0 01-3 0m3 0a1.5 1.5 0 00-3 0m3 0h6m-9 0H3.375a1.125 1.125 0 01-1.125-1.125V14.25m17.25 4.5a1.5 1.5 0 01-3 0m3 0a1.5 1.5 0 00-3 0m3 0h1.125c.621 0 1.129-.504 1.09-1.124a17.902 17.902 0 00-3.213-9.193 2.056 2.056 0 00-1.58-.86H14.25M16.5 18.75h-2.25m0-11.177v-.958c0-.568-.422-1.048-.987-1.106a48.554 48.554 0 00-10.026 0 1.106 1.106 0 00-.987 1.106v7.635m12-6.677v6.677m0 4.5v-4.5m0 0h-12" />
            </svg>
        </x-count>

        <x-count title="فشل التوصيل" count="{{ $deliveryFailureCount }} طلب " color="rgb(255, 246, 237)">
            <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="1.5"
                stroke="rgb(236, 74, 10)" class="w-6 h-6">
                <path stroke-linecap="round" stroke-linejoin="round" d="M6 18L18 6M6 6l12 12" />
            </svg>
        </x-count>


        <x-count title="تم التوصيل" count="{{ $deliveredCount }} طلب " color="#ecfdf3">

            <i class="fa-solid fa-people-carry-box" style="color:#039855"></i>
        </x-count>

        <x-count title="مكتمل" count="{{ $done }} طلب " color="#ecfdf3">
            <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="1.5"
                stroke="#039855" class="w-6 h-6">
                <path stroke-linecap="round" stroke-linejoin="round"
                    d="M9 12.75L11.25 15 15 9.75M21 12a9 9 0 11-18 0 9 9 0 0118 0z" />
            </svg>
        </x-count>

        <x-count title="طلب استرجاع" count="{{ $return }} طلب " color="rgb(255, 246, 237)">
            <svg width="1em" height="1em" viewBox="0 0 20 20" fill="currentColor"
                xmlns="http://www.w3.org/2000/svg" aria-hidden="true" focusable="false" class="">
                <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M10 3.5C6.41015 3.5 3.5 6.41015 3.5 10C3.5 13.5899 6.41015 16.5 10 16.5C13.5899 16.5 16.5 13.5899 16.5 10C16.5 6.41015 13.5899 3.5 10 3.5ZM2 10C2 5.58172 5.58172 2 10 2C14.4183 2 18 5.58172 18 10C18 14.4183 14.4183 18 10 18C5.58172 18 2 14.4183 2 10ZM10 4.9C10.4142 4.9 10.75 5.23579 10.75 5.65V9.53647L13.2354 10.7792C13.6059 10.9644 13.7561 11.4149 13.5708 11.7854C13.3856 12.1559 12.9351 12.3061 12.5646 12.1208L9.66459 10.6708C9.4105 10.5438 9.25 10.2841 9.25 10V5.65C9.25 5.23579 9.58579 4.9 10 4.9Z"
                    fill="rgb(236, 74, 10)"></path>
            </svg>
        </x-count>

        <x-count title="قيد الانتظار" count="{{ $waitingCount }} طلب " color="rgb(255, 246, 237)">
            <svg width="1em" height="1em" viewBox="0 0 20 20" fill="currentColor"
                xmlns="http://www.w3.org/2000/svg" aria-hidden="true" focusable="false" class="">
                <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M10 3.5C6.41015 3.5 3.5 6.41015 3.5 10C3.5 13.5899 6.41015 16.5 10 16.5C13.5899 16.5 16.5 13.5899 16.5 10C16.5 6.41015 13.5899 3.5 10 3.5ZM2 10C2 5.58172 5.58172 2 10 2C14.4183 2 18 5.58172 18 10C18 14.4183 14.4183 18 10 18C5.58172 18 2 14.4183 2 10ZM10 4.9C10.4142 4.9 10.75 5.23579 10.75 5.65V9.53647L13.2354 10.7792C13.6059 10.9644 13.7561 11.4149 13.5708 11.7854C13.3856 12.1559 12.9351 12.3061 12.5646 12.1208L9.66459 10.6708C9.4105 10.5438 9.25 10.2841 9.25 10V5.65C9.25 5.23579 9.58579 4.9 10 4.9Z"
                    fill="rgb(236, 74, 10)"></path>
            </svg>
        </x-count>


        <x-count  notClick= true title="نسبة التسليمات" count="{{$precent}} %" color="#eff3fa">
        <i class="fa-solid fa-percent" style="color: #0E6EFF"></i>
    </x-count>

    </div>
@endsection


@section('js')
    <script>
        $('aside .home').addClass('active');
    </script>
@endsection
